import Icon from "react-icons-kit";
import { ic_search } from "react-icons-kit/md/ic_search";
import { shoppingCart } from "react-icons-kit/feather/shoppingCart";
import { login } from "react-icons-kit/ikons/login";
import NavbarItems from "./NavbarItems";
import { bars } from "react-icons-kit/fa/bars";
import { ic_local_fire_department } from "react-icons-kit/md/ic_local_fire_department";
import { location } from "react-icons-kit/oct/location";
import { iosLocation } from "react-icons-kit/ionicons/iosLocation";
import { shoppingBasket } from "react-icons-kit/fa/shoppingBasket";
import { percent } from "react-icons-kit/fa/percent";
import { x } from "react-icons-kit/oct/x";
import { basket } from "react-icons-kit/ikons/basket";
import { tags } from "react-icons-kit/ikons/tags";
import { useEffect, useState } from "react";
import { useDispatch, useSelector } from "react-redux";
import { fetchHeader } from "../../Redux/Posts/HeaderReducer";
import { Link } from "react-router-dom";
import { fetchUser } from "../../Redux/Posts/UserReducer";
import { arrow_left } from "react-icons-kit/ikons/arrow_left";

const Header = () => {
  let NavbarItemsP = {
    productSorting: {
      text: "دسته‌بندی کالاها",
      icon: bars,
      size: "text-md",
      id: 1,
    },
    digikalaPagesNavbar: [
      {
        text: "شگفت‌انگیزها",
        icon: bars,
        color: "text-gray-500",
        size: "text-xs",
        id: 2,
      },
      {
        text: "سوپرمارکت",
        icon: basket,
        color: "text-gray-500",
        size: "text-xs",
        id: 3,
      },
      {
        text: "کارت هدیه",
        icon: percent,
        color: "text-gray-500",
        size: "text-xs",
        id: 4,
      },
      {
        text: "پرفروش‌ترین‌ها",
        icon: ic_local_fire_department,
        color: "text-gray-500",
        size: "text-xs",
        id: 5,
      },
      {
        text: "تخفیف‌ها و پیشنهادها",
        icon: tags,
        color: "text-gray-500",
        size: "text-xs",
        id: 6,
      },
    ],
    digikalaQuestionsNavbar: [
      { text: "سوالی دارید؟", color: "text-gray-500", size: "text-xs", id: 7 },
      {
        text: "در دیجی‌کالا بفروشید!",
        color: "text-gray-500",
        size: "text-xs",
        id: 8,
      },
    ],
    locationNavbar: {
      text: "لطفا شهر خود را انتخاب کنید",
      color: "text-gray-800",
      icon: location,
      size: "text-xs",
    },
  };
  // {
  //   title: "",
  //   items: ""
  // }
  let submenu = [
    {
      title: "موبایل",
      moreProductsLink: "همه محصولات موبایل",
      categories: [
        {
          title: "برند های گوشی موبایل",
          items: [
            "گوشی آیفون",
            "گوشی سامسونگ",
            "گوشی شیائومی",
            "گوشی نوکیا",
            "گوشی ریلمی",
            "گوشی آنر",
            "گوشی موتورولا",
            "گوشی ناتینگ فون",
            "گوشی جی پلاس",
            "گوشی هواوی",
            "گوشی جی ال ایکس",
            "گوشی های جنرال لوکس",
            "گوشی داریا",
            "گوشی گوگل",
            "گوشی اوپو",
            "گوشی ارد",
            "گوشی وان پلاس",
            "گوشی موبایل رنسو",
          ],
        },
        {
          title: "برندهای برتر",
          items: [
            "شیائومی",
            "سامسونگ",
            "اپل",
            "هواوی",
            "توشیبا",
            "تکنو",
            "ایرانسل",
            "مبین نت",
            "نینتندو",
            "بیتس",
            "جی بی ال",
            "وان مور",
            "تی پی لینک",
            "دی لینک",
            "کیو سی وای",
          ],
        },
        {
          title: "گوشی براساس قیمت",
          items: [
            "گوشی موبایل ارزان",
            "گوشی موبایل قسطی",
            "گوشی تا 2 میلیون تومان",
            "گوشی تا 5 میلیون تومان",
            "گوشی تا 7 میلیون تومان",
            "گوشی تا 15 میلیون تومان",
            "گوشی بالای 15 میلیون تومان",
          ],
        },
        {
          title: "گوشی براساس عملکرد",
          items: [
            "گوشی گیمینگ",
            "گوشی 5G",
            "گوشی دکمه ای",
            "گوشی ضد آب",
            "گوشی مناسب عکاسی",
            "گوشی میان رده",
            "گوشی اقتصادی",
            "گوشی دانش آموزی",
            "گوشی پرچمدار",
            "دو سیمکارت",
          ],
        },
        {
          title: "گوشی براساس حافظه داخلی",
          items: [
            "گوشی تا 16 گیگابایت",
            "گوشی تا 32 گیگابایت",
            "گوشی تا 64 گیگابایت",
            "گوشی تا 128 گیگابایت",
            "گوشی تا 256 گیگابایت",
            "گوشی تا 1 ترابایت",
          ],
        },
        {
          title: "رزولوشن عکس",
          items: [
            "گوشی تا 13 مگاپیکسل",
            "گوشی تا 16 مگاپیکسل",
            "گوشی تا 48 مگاپیکسل",
            "گوشی تا 64 مگاپیکسل",
            "گوشی تا 108 مگاپیکسل",
          ],
        },
        {
          title: "لوازم جانبی موبایل",
          items: [
            "شارژر گوشی",
            "قاب و کاور گوشی",
            "گلس گوشی",
            "هولدر گوشی موبایل",
            "کابل شارژ و مبدل",
            "پاوربانک (شارژر همراه)",
          ],
        },
        {
          title: "تبلت",
          items: [
            "تبلت سامسونگ",
            "تبلت اپل (آی پد)",
            "تبلت شیائومی",
            "تبلت لنوو",
            "تبلت مایکروسافت",
            "تبلت دانش آموزی",
          ],
        },
        {
          title: "هدفون",
          items: [
            "هدفون بی سیم",
            "هدفون اپل (ایرپاد)",
            "هدفون بیتس",
            "هدفون سونی",
            "هدفون سامسونگ (ایرپادز)",
            "هدفون شیائومی",
            "هدفون جی بی ال",
          ],
        },
        {
          title: "ساعت و مچ بند هوشمند",
          items: ["ساعت هوشمند سامسونگ", "ساعت هوشمند شیائومی", "اپل واچ"],
        },
        {
          title: "داغ ترین ها",
          items: [
            "گلکسی S23 Ultra",
            "گلکسی A54",
            "گلکسی A34",
            "گلکسی A24",
            "گلکسی A14",
            "گلکسی S23FE",
            "ردمی نوت 12",
            "پوکو C40",
            "پوکو X5 Pro 5G",
            "ردمی A2 Plus",
            "پوکو M5s",
            "آنر X9a",
            "موتورولا moto E13",
            "جی پلاس Q20s",
            "داریا باند 5G",
            "جدیدترین محصولات اپل",
          ],
        },
      ],
    },
    {
      title: "محصولات دیجیتال",
      moreProductsLink: "همه محصولات دیجیتال",
      categories: [
        {
          title: "لپ تاپ",
          items: [
            "لپ تاپ ایسوس",
            "لپ تاپ لنوو",
            "مک بوک",
            "لپ تاپ HP",
            "لپ تاپ دل",
            "لپ تاپ ایسر",
            "لپ تاپ ام اس آی",
            "لپ تاپ کاستوم",
          ],
        },
        {
          title: "اکسسوری های لب تاب",
          items: ["شارژر لپ تاپ", "کیف لپ تاپ", "کول پد", "استیکر لپ تاپ"],
        },
        {
          title: "کنسول گیمینگ",
          items: ["ps5", "xbox", "ps4"],
        },
        {
          title: "اکسسوری گیمینگ",
          items: ["دسته بازی", "فرمان بازی"],
        },

        {
          title: "هدفون",
          items: [
            "هدفون بی سیم",
            "هدفون اپل (ایرپاد)",
            "هدفون بیتس",
            "هدفون سونی",
            "هدفون سامسونگ (ایربادز)",
            "هدفون شیائومی",
            "هدفون جی بی ال",
            "هدفون ریزر",
          ],
        },
        {
          title: "ساعت هوشمند",
          items: [
            "ساعت هوشمند سامسونگ",
            "ساعت هوشمند شیائومی",
            "اپل واچ",
            "بند اپل واچ",
            "بند ساعت هوشمند",
            "لوازم جانبی ساعت هوشمند",
          ],
        },
        {
          title: "دوربین",
          items: [
            "دوربین فیلمبرداری",
            "دوربین کنون",
            "دوربین سونی",
            "دوربین چاپ سریع",
            "رینگ لایت",
            "پایه دوربین",
            "لنز دوربین",
            "کارت حافظه",
          ],
        },
        {
          title: "ذخیره سازی اطلاعات",
          items: ["هارد ssd", "هارد اینترنال", "هارد اکسترنال"],
        },
        { title: "فلش", items: ["فلش 256 گیگ", "فلش 128 گیگ", "فلش 64 گیگ"] },
        {
          title: "پاوربانک",
          items: [
            "فست شارژ",
            "پاوربانک شیائومی",
            "پاوربانک انکر",
            "پاوربانک اپل",
            "پاوربانک سامسونگ",
            "پاوربانک انرجایزر",
          ],
        },

        {
          title: "پرینتر",
          items: [
            "پرینتر سه بعدی",
            "پرینتر حرارتی",
            "پرینتر رنگی",
            "پرینتر لیبل زن",
            "پرینتر اچ پی",
          ],
        },
        {
          title: "ماشین های اداری",
          items: [
            "کابل پرینتر",
            "کارتریج",
            "اسکنر",
            "تلفن",
            "بارکدخوان",
            "ویدئو وال",
            "ویدئو پروژکتور",
            "دستگاه حضور و غیاب",
          ],
        },
        {
          title: "پرینتر",
          items: [
            "پرینتر سه بعدی",
            "پرینتر حرارتی",
            "پرینتر رنگی",
            "پرینتر لیبل زن",
            "پرینتر اچ پی",
          ],
        },
        {
          title: "پرینتر",
          items: [
            "پرینتر سه بعدی",
            "پرینتر حرارتی",
            "پرینتر رنگی",
            "پرینتر لیبل زن",
            "پرینتر اچ پی",
          ],
        },
        {
          title: "پرینتر",
          items: [
            "پرینتر سه بعدی",
            "پرینتر حرارتی",
            "پرینتر رنگی",
            "پرینتر لیبل زن",
            "پرینتر اچ پی",
          ],
        },

        {
          title: "تبلت",
          items: [],
        },
        {
          title: "خانه هوشمند",
          items: [],
        },
        {
          title: "برندهای برتر",
          items: [
            "شیائومی",
            "سامسونگ",
            "اپل",
            "هواوی",
            "توشیبا",
            "تکنو",
            "ایرانسل",
            "مبین نت",
            "نینتندو",
            "بیتس",
            "جی بی ال",
            "وان مور",
            "تی پی لینک",
            "دی لینک",
            "کیو سی وای",
          ],
        },
        {
          title: "داغ ترین ها",
          items: ["گیمینگ", "هدفون گربه ای", "فیفا"],
        },
      ],
    },
    {
      title: "کتاب، لوازم تحریر و هنر",
      categories: [
        {
          title: "صنایع دستی",
          items: [
            "کالاهای مس",
            "سفال، سرامیک و چینی",
            "کیف چرمی",
            "ترمه، قلمکار و دستبافت",
            "خاتم، منبت، حصیری و چوبی",
            "تابلو و ساعت",
            "میناکاری",
            "فیروزه کوبی",
            "سوزن دوزی",
            "محصولات استخوانی",
            "جعبه و دست سازه های هنری",
          ],
        },
        {
          title: "آلات موسیقی",
          items: [
            "لوازم جانبی آلات موسیقی",
            "گیتار",
            "کیبورد و ارگ",
            "پیانو دیجیتال",
            "درام، پرکاشن، دف",
            "تجهیزات استودیویی",
            "ویولن",
            "سازهای ایرانی",
          ],
        },
        {
          title: "فرش ماشینی، دستبافت، تابلو",
          items: ["فرش ماشینی", "فرش دستبافت", "تابلو"],
        },
        {
          title: "لوازم تحریر",
          items: [
            "لوازم اداری و اقلام مصرفی",
            "کیف، کوله پشتی و جامدادی",
            "چراغ مطالعه",
            "کاغذ کادو، پاکت و کارت هدیه",
            "نوشت افزار",
            "دفتر و کاغذ",
            "خودکار و روان نویس",
            "ابزار نقاشی و رنگ آمیزی",
            "میز تحریر",
            "آلبوم عکس",
            "کاغذ چاپ و پرینتر",
            "مداد و مداد رنگی",
          ],
        },
        {
          title: "کتاب و مجله",
          items: ["کتاب چاپی", "محصولات خارجی و داخلی"],
        },
        {
          title: "کتاب صوتی",
          items: [],
        },
        {
          title: "محتوای آموزشی",
          items: [
            "آموزش موسیقی",
            "آموزش ورزش و سرگرمی",
            "آموزش زبان",
            "آموزش نرم افزار و کامپیوتر",
          ],
        },
        {
          title: "نرم افزار",
          items: [],
        },
        {
          title: "بازی، کنسول و کامپیوتر",
          items: [],
        },
        {
          title: "فیلم سینمایی، سریال و مستند",
          items: [],
        },
        {
          title: "آلبوم موسیقی",
          items: [],
        },
      ],
    },
    {
      title: "خانه و آشپزخانه",
      categories: [
        {
          title: "ظروف پخت و پز",
          items: ["قابلمه و تابه", "زودپز", "سرویس پخت و پز"]
        },
        {
          title: "ابزار آشپزی",
          items: ["ست کفگیر و ملاقه", "چاقو", "تخته گوشت", "ظرف و قالب یخ", "قیف", "صافی", "فندک آشپزخانه", "ترازوی آشپزخانه"]
        },{
          title: "تهیه و سرو چای و قهوه",
          items: ["قهوه ساز و دمنوش ساز", "سماور", "شیرجوش - قهوه جوش", "قوری", "کتری و قوری", "فیلتر چای"]
        },{
          title: "ظروف آشپزخانه",
          items: ["آبکش و آبگیر", "بطری", "ارگانایزر آشپزخانه", "جای ادویه", "بانکه و ظروف بنشن", "شکر پاش و نمک پاش", "سبد آشپزخانه", "سبد سیب زمینی و پیاز", "ظرف نگهدارنده", "سایر ظروف"]
        },{
          title: "لوازم تهیه کیک و دسر",
          items: []
        },
        {
          title: "سرو و پذیرایی",
          items: ["سفره", "ماگ", "سینی", "لیوان", "بشقاب", "قندان", "پارچ و بطری", "بستنی خوری", "سس خوری و آبلیمو خوری", "کاسه و پیاله", "کلمن و فلاسک", "ظروف سرو و پذیرایی", "سرویس غذاخوری", "قاشق، چنگال و کارد", "زیرلیوانی، زیر بشقابی و زیر قابلمه ای", "ابزار مهمانی"]
        },{
          title: "منسوجات آشپزخانه",
          items: ["دستگیره", "پیش بند", "کیسه نان و سبزی", "دستمال نظافت خانه و آشپزخانه"]
        },
        {
          title: "مبلمان و دکوراسیون داخلی",
          items: [
            "پاف و بین بگ",
            "مبل",
            "کتابخانه",
            "شلف و طبقه",
            "کنسول",
            "صندلی",
            "میز ناهارخوری",
          ],
        },
        {
          title: "مبلمان و دکوراسیون اداری",
          items: ["صندلی اداری", "میز اداری"],
        },
        {
          title: "نگهدارنده لباس و لوازم",
          items: [
            "کمد لباس و ارگانایزر",
            "جاکفشی",
            "جالباسی",
            "کاور لوازم خانگی",
          ],
        },
        {
          title: "دکوراتیو",
          items: [
            "مجسمه و تندیس",
            "ساعت",
            "عود",
            "شمع",
            "شمعدان",
            "دیوارکوب",
            "اسماج",
            "گل و گلدان",
            "آینه دکوراتیو",
          ],
        },
        {
          title: "حمام",
          items: [],
        },
        {
          title: "سرویس بهداشتی",
          items: [],
        },
        {
          title: "خواب",
          items: [],
        },
        {
          title: "شستشو و نظافت",
          items: [],
        },
        {
          title: "نظافت لباس",
          items: [],
        },
      ],
    },
    {
      "title": "لوازم خانگی برقی",
      "categories": [
        {
          "title": "خردکن و غذاساز",
          "items": [
            "گوشت کوب برقی",
            "غذاساز",
            "همزن",
            "مخلوط کن",
            "چرخ گوشت",
            "خردکن",
            "آسیاب"
          ]
        },
        {
          "title": "لوازم توکار",
          "items": [
            "فر",
            "هود",
            "گاز صفحه ای",
            "سینک ظرفشویی"
          ]
        },
        {
          "title": "لوازم پخت و پز",
          "items": [
            "سرخ کن بدون روغن (airfrier)",
            "مایکروویو، مایکروفر",
            "اجاق گاز",
            "پلوپز",
            "ساندویچ ساز و وافل ساز",
            "آون توستر",
            "گریل و باربیکیو",
            "توستر"
          ]
        },
        {
          "title": "نوشیدنی ساز",
          "items": [
            "قهوه ساز",
            "اسپرسو ساز",
            "چای ساز",
            "کتری برقی",
            "سماور برقی",
            "آبمیوه گیری",
            "آب مرکبات گیر",
            "آسیاب قهوه"
          ]
        },
        {
          "title": "یخچال فریزر",
          "items": [
            "یخچال فریزر ساید بای ساید",
            "یخچال فریزر دوقولو",
            "یخچال فریزر هتلی",
            "یخچال فریزر کمبی"
          ]
        },
        {
          "title": "جاروبرقی",
          "items": [
            "جارو شارژی",
            "لوازم جانبی جاروبرقی و بخارشور"
          ]
        },
        {
          "title": "بخار شو",
          "items": []
        },
        {
          "title": "ماشین لباسشویی",
          "items": [
            "ماشین لباسشویی دوو",
            "ماشین لباسشویی پاکشوما",
            "ماشین لباسشویی اسنوا",
            "مینی واش"
          ]
        },
        {
          "title": "ماشین ظرفشویی",
          "items": []
        },
        {
          "title": "اتو",
          "items": [
            "اتو بخار ایستاده",
            "اتو بخار",
            "بخارگر"
          ]
        },
        {
          "title": "چرخ خیاطی",
          "items": [
            "چرخ خیاطی ژانومه",
            "چرخ خیاطی کاچیران"
          ]
        },
        {
          "title": "صوتی و تصویری",
          "items": [
            "تلوزیون",
            "ساندبار",
            "ویدیو پروژکتور",
            "لوازم جانبی صوتی و تصویری",
            "ریموت کنترل",
            "میز تلوزیون"
          ]
        },
        {
          "title": "تهویه، سرمایش و گرمایش",
          "items": [
            "بخاری",
            "بخاری برقی",
            "تصفیه کننده هوا",
            "پکیج دیواری و رادیاتور",
            "آبگرمکن",
            "شوفاژ برقی",
            "کولر گازی",
            "کولر آبی",
            "پنکه"
          ]
        }
      ],
    },
    {
      "title": "مد و پوشاک",
      "categories": [
        {
          "title": "کفش ورزشی مردانه",
          "items": []
        },
        {
          "title": "کفش ورزشی زنانه",
          "items": []
        },
        {
          "title": "پوشاک ورزشی پسرانه",
          "items": []
        },
        {
          "title": "پوشاک ورزشی دخترانه",
          "items": []
        },
        {
          "title": "کفش ورزشی پسرانه",
          "items": []
        },
        {
          "title": "کفش ورزشی دخترانه",
          "items": []
        },
        {
          "title": "کوله پشتی مردانه",
          "items": []
        },
        {
          "title": "بچگانه",
          "items": []
        },
        {
          "title": "طلا",
          "items": ["زنانه", "مردانه", "بچگانه"]
        },
        {
          "title": "زیورآلات زنانه",
          "items": ["دستبند", "گوشواره", "گردنبند"]
        },
        {
          "title": "زیورآلات نقره زنانه",
          "items": []
        },
        {
          "title": "عینک آفتابی زنانه",
          "items": []
        },
        {
          "title": "عینک آفتابی مردانه",
          "items": []
        },
        {
          "title": "پوشاک ورزشی مردانه",
          "items": []
        },
        {
          "title": "پوشاک ورزشی زنانه",
          "items": []
        },
        {
          "title": "زنانه",
          "items": []
        },
        {
          "title": "لباس زنانه",
          "items": [
            "مانتو پانچو رویه",
            "بلوز و شومیز زنانه",
            "لباس راحتی زنانه",
            "شلوار و سرهمی زنانه",
            "لباس زیر"
          ]
        },
        {
          "title": "کفش زنانه",
          "items": ["کفش روزمره", "کفش تخت"]
        },
        {
          "title": "اکسسوری زنانه",
          "items": ["ساعت", "کیف", "شال و روسری"]
        },
        {
          "title": "پوشاک مردانه",
          "items": []
        },
        {
          "title": "لباس مردانه",
          "items": ["تی شرت مردانه", "پیراهن مردانه"]
        },
        {
          "title": "پالتو بارانی و کاپشن مردانه",
          "items": []
        },
        {
          "title": "کفش مردانه",
          "items": ["کفش روزمره", "کفش رسمی"]
        },
        {
          "title": "اکسسوری مردانه",
          "items": ["ساعت", "کیف", "کمربند"]
        }
      ]
    },
    {
      "title": "زیبایی و سلامت",
      "categories": [
        {
          "title": "عطر و ادکلن",
          "items": [
            "عطر و ادکلن زنانه",
            "عطر و ادکلن مردانه",
            "بادی اسپلش",
            "عطر جیبی"
          ]
        },
        {
          "title": "لوازم شخصی و برقی",
          "items": [
            "سشوار",
            "اتو حالت دهنده مو",
            "اصلاح موی صورت",
            "اصلاح موی سر"
          ]
        },
        {
          "title": "ابزار سلامت",
          "items": [
            "ماساژور",
            "ترازو",
            "دستگاه بخور و رطوبت ساز",
            "فشارسنج",
            "تست قند خون",
            "ویلچر",
            "ساپورت های طبی",
            "دستکش های طبی",
            "تزریقات",
            "مکمل دارویی",
            "مکمل ورزشی و تناسب اندام"
          ]
        },
        {
          "title": "مراقبت زیبایی و مو",
          "items": [
            "شامپو و مراقبت مو",
            "آرایش مو"
          ]
        },
        {
          "title": "لوازم بهداشتی",
          "items": [
            "مراقبت دهان و دندان",
            "مسواک",
            "خمیردندان",
            "دئودورانت و ضد تعریق",
            "محصولات بهداشت جنسی",
            "کاندوم",
            "بهداشت و مراقبت شخصی",
            "نوار بهداشتی",
            "کاپ قاعدگی",
            "لوازم اصلاح مو",
            "تیغ و یدک اصلاح"
          ]
        },
        {
          "title": "لوازم آرایشی",
          "items": [
            "آرایش صورت",
            "آرایش چشم",
            "آرایش ابرو",
            "آرایش لب",
            "بهداشت و زیبایی ناخن",
            "ابزار آرایشی"
          ]
        },
        {
          "title": "مراقبت پوست",
          "items": [
            "کرم مرطوب کننده و نرم کننده",
            "ماسک صورت و بدن",
            "پاک کننده صورت",
            "تونر",
            "مراقبت بدن",
            "ابزار مراقبت پوست"
          ]
        }
      ],
    },
    {
      "title": "کارت هدیه",
      "categories": [
        {
          "title": "کارت هدیه سازمانی",
          "items": []
        },
        {
          "title": "کارت هدیه مد و پوشاک",
          "items": []
        },
        {
          "title": "کارت هدیه اکسسوری مد و پوشاک",
          "items": []
        },
        {
          "title": "کارت هدیه دیجی استایل",
          "items": []
        },
        {
          "title": "کارت هدیه فیدیبو",
          "items": []
        },
        {
          "title": "کارت هدیه الکترونیکی دیجی کالا",
          "items": []
        },
        {
          "title": "کارت هدیه الکترونیکی براساس مناسبت",
          "items": [
            "کارت هدیه الکترونیکی تولد",
            "کارت هدیه الکترونیکی روز معلم",
            "کارت هدیه الکترونیکی سالگرد",
            "کارت هدیه الکترونیکی تشکر",
            "کارت هدیه الکترونیکی عذرخواهی",
            "کارت هدیه الکترونیکی دوستی",
            "کارت هدیه الکترونیکی ازدواج",
            "کارت هدیه الکترونیکی نوزاد",
            "کارت هدیه الکترونیکی خانه نو",
            "کارت هدیه الکترونیکی فارغ التحصیلی",
            "کارت هدیه الکترونیکی عید نوروز"
          ]
        },
        {
          "title": "کارت هدیه فیزیکی دیجی کالا",
          "items": []
        },
        {
          "title": "کارت هدیه براساس مناسبت",
          "items": [
            "کارت هدیه تولد",
            "کارت هدیه روز معلم",
            "کارت هدیه سالگرد",
            "کارت هدیه تشکر",
            "کارت هدیه عذرخواهی",
            "کارت هدیه دوستی",
            "کارت هدیه ازدواج",
            "کارت هدیه نوزاد",
            "کارت هدیه خانه نو",
            "کارت هدیه فارغ التحصیلی",
            "کارت هدیه عید نوروز",
            "کارت هدیه شب یلدا"
          ]
        },
        {
          "title": "کارت هدیه براساس قیمت",
          "items": [
            "کارت هدیه تا 500 هزار تومان",
            "کارت هدیه از 500 هزار تا 2 میلیون تومان",
            "کارت هدیه از 2 میلیون تا 5 میلیون تومان",
            "کارت هدیه 5 میلیون تومانی",
            "کارت هدیه از 5 میلیون تا 10 میلیون تومان",
            "کارت هدیه از 10 میلیون تا 20 میلیون تومان",
            "کارت هدیه بیش از 20 میلیون تومان"
          ]
        }
      ],
    },
    {
      "title": "کالاهای سوپرمارکتی",
      "categories": [
        {
          "title": "مواد پروتئینی و تخم مرغ",
          "items": [
            "گوشت گوسفند",
            "گوشت گوساله",
            "گوشت مرغ",
            "تخم مرغ",
            "ماهی",
            "میگو",
            "خاویار",
            "سوسیس"
          ]
        },
        {
          "title": "میوه و سبزیجات",
          "items": [
            "میوه",
            "سبزیجات",
            "خرما"
          ]
        },
        {
          "title": "بهداشت و نظافت خانگی",
          "items": [
            "اسکاچ و سیم ظرفشویی",
            "دستکش نظافت",
            "مواد شوینده",
            "شوینده لباس",
            "شوینده ظروف",
            "شوینده سطوح",
            "مایع دستشویی",
            "شوینده فرش و مبل",
            "لوازم یکبار مصرف آشپزخانه",
            "دستمال کاغذی"
          ]
        },
        {
          "title": "بهداشت و خوراک کودک",
          "items": [
            "غذای کودک",
            "پوشک کودک",
            "دهانشویه و خمیردندان کودک",
            "مسواک کودک",
            "دستمال مرطوب کودک",
            "کرم، بالم و لوسیون کودک",
            "شامپو کودک",
            "شوینده لباس کودک"
          ]
        },
        {
          "title": "بهداشت شخصی",
          "items": [
            "بهداشت دهان و دندان",
            "کاندوم",
            "پد بهداشتی"
          ]
        },
        {
          "title": "لبنیات",
          "items": [
            "شیر",
            "پنیر",
            "کره",
            "ماست",
            "دوغ",
            "خامه",
            "کشک"
          ]
        },
        {
          "title": "صبحانه",
          "items": [
            "کره بادام زمینی",
            "شکلات صبحانه",
            "غلات صبحانه",
            "عسل",
            "پنیر صبحانه"
          ]
        },
        {
          "title": "نوشیدنی",
          "items": [
            "آب معدنی",
            "نوشابه",
            "ماء الشعیر",
            "انرژی زا",
            "شربت و آبمیوه",
            "عرقیات و گلاب"
          ]
        },
        {
          "title": "ترشی و شور",
          "items": [
            "زیتون",
            "ترشی",
            "شور",
            "خیارشور"
          ]
        },
        {
          "title": "تنقلات",
          "items": [
            "چیپس",
            "پفک",
            "تخمه",
            "لواشک",
            "کیک و کلوچه",
            "شکلات",
            "پاستیل",
            "آدامس",
            "بیسکوییت"
          ]
        },
        {
          "title": "آجیل",
          "items": [
            "فندق",
            "پسته",
            "بادام زمینی",
            "بادام هندی",
            "انجیر"
          ]
        },
        {
          "title": "شیرینی",
          "items": [
            "گز، سوهان و پولکی",
            "پشمک، مسقطی و باسلوق"
          ]
        },
        {
          "title": "کالاهای اساسی و خوار و بار",
          "items": [
            "نان",
            "ماکارانی",
            "برنج",
            "نبات",
            "قند",
            "شکر",
            "رب گوجه",
            "رب انار"
          ]
        },
        {
          "title": "روغن",
          "items": [
            "روغن مایع",
            "روغن جامد و نیمه جامد",
            "روغن زیتون",
            "روغن ذرت",
            "روغن کنجد",
            "روغن حیوانی"
          ]
        },
        {
          "title": "چای و دمنوش",
          "items": [
            "چای سبز",
            "چای سیاه",
            "دمنوش",
            "چای ماسالا"
          ]
        },
        {
          "title": "قهوه",
          "items": [
            "دانه قهوه",
            "قهوه فوری",
            "قهوه اسپرسو"
          ]
        },
        {
          "title": "غذاهای آماده و نیمه آماده",
          "items": [
            "تن ماهی",
            "نودل",
            "غذاهای آماده یخچالی",
            "غذاهای آماده کنسروی"
          ]
        },
        {
          "title": "حبوبات و سویا",
          "items": [
            "عدس",
            "ماش",
            "کینوا",
            "لپه",
            "نخود",
            "لوبیا",
            "سویا"
          ]
        }
      ]
    },
    {
      "title":"اسباب بازی، کودک و نوزاد",
      "categories":[
        {"title": "ملزومات گردش و سفر",
        "items": [
          "کالسکه و کریر",
          "صندلی خودرو کودک و نوزاد",
          "ساک لوازم نوزاد",
          "لوازم جانبی گردش و سفر",
          "آغوشی"
        ]},
        {"title":"لوازم شخصی",
        "items": [
          "پستانک و ملزومات",
          "شیردوش",
          "شورت آموزشی"
        ]},
        {"title":"غذاخوری",
        "items": [
          "صندلی غذاخوری",
          "شیشه شیر"
        ]},
        {"title":"سلامت، ایمنی و مراقبت",
        "items": [
          "تصفیه هوا ترازو",
          "دوربین و پیجر اتاق کودک",
          "تب سنج و دماسنج",
          "محافظ و ابزار ایمنی"
        ]},
        {"title":"خواب کودک",
        "items": [
          "مبلمان اتاق کودک",
          "چراغ خواب کودک",
          "تشک کودک",
          "سرویس خواب",
          "پتو"
        ]},
        {"title":"تبلت",
        "items": []},
        {"title":"پلی استیشن، ایکس باکس و بازی",
        "items": []},
        {"title":"اسباب بازی",
        "items": [
          "فکری و آموزشی",
          "پازل، لگو و ساختنی",
          "عروسک و فیگور",
          "اسپینر، ابزار شوخی و سرگرمی",
          "تفنگ، تیر و لوازم جنگی"
        ]},
        {"title":"بازی و سرگرمی کودک",
        "items": [
          "ماشین بازی، موتور و سه چرخه",
          "دوچرخه",
          "تشک بازی و پارک بازی",
          "تاپ و سرسره"
        ]},
        {"title":"بهداشت و حمام کودک و نوزاد",
        "items": [
          "پوشک",
          "دستمال مربوط",
          "حوله",
          "وان حمام نوزاد",
          "مینی واش",
          "شامپو کودک و نوزاد"
        ]},
        {"title":"پوشاک و کفش کودک و نوزاد",
        "items": [
          "لباس کودک و لباس نوزادی",
          "کفش",
          "جوراب و پاپوش کودک و نوزاد",
          "کلاه و پیش بند نوزاد"
        ]}
     ]
    },
    {
      "title": "ابزارآلات و تجهیزات",
      "categories": [
        {"title":"حفاظتی و امنیتی",
          "items": [
          "گاوصندوق",
          "قفل"
        ]},
        {"title": "دستگاه های حمل و بالابر صنعتی",
          "items": [
          "قطعات یدکی ماشین آلات صنعتی",
          "تجهیزات کارگاهی"
        ]},
        {"title": "لوازم الکتریکی و یراق آلات",
          "items": [
          "شیرآلات",
          "رنگ",
          "لوازم الکتریکی",
          "مصالح ساختمانی",
          "زنگ و در بازکن"
        ]},
        {"title:": "لوازم باغبانی و کشاورزی",
          "items": [
          "ابزار باغبانی",
          "ادوات کشاورزی",
          "بذر و تخم گیاهان",
          "خاک، کود و آفت کش",
          "کاشت و پرورش گیاه"
        ]},
        {"title": "تجهیزات ایمنی و کار",
          "items": [
          "ماسک تنفسی",
          "لوازم آتش نشانی",
          "لوازم ایمنی و کار",
          "جعبه کمک های اولیه",
          "برچسب و علائم ایمنی"
        ]},
        {"title": "ابزار غیر برقی",
          "items": [
          "ابزار دستی",
          "مجموعه ابزار",
          "نردبان",
          "پیچ گوشتی و فازمتر",
          "نظم دهنده ابزار",
          "متر، تراز، اندازه گیری دقیق",
          "لوازم روانکاری",
          "چسب صنعتی",
          "انواع آچار و انبر",
          "پیچ و مهره، رول پلاک، میخ و پرچ",
          "مته و سری",
          "اره",
          "لوازم بسته بندی"
        ]},
        {"title": "ابزار برقی",
          "items": [
          "دریل، پیچ گوشتی و آچار بکس",
          "فرز و سنگ رومیزی",
          "موتور برق",
          "مکنده - دمنده",
          "جاروبرقی صنعتی",
          "کارواش",
          "دستگاه جوش",
          "هویه",
          "ابزار برش و تراشکاری",
          "کمپرسور هوا"
        ]}
      ]
    },
    {
      "title": "خودرو و موتورسیکلت",
      "categories": [
        {"title":"لوازم موتورسیکلت",
          "items": [
          "لوازم مصرفی",
          "لوازم یدکی",
          "لوازم جانبی",
          "لوازم ضد سرقت"
        ]},
        {"title": "لوازم جانبی خودرو",
          "items": [
          "لامپ",
          "سایر لوازم جانبی",
          "تجهیزات آفرود",
          "تیونینگ و تقویت موتور",
          "انواع جک",
          "جاسوئیچی",
          "خوشبوکننده و تصفیه کننده هوای کابین",
          "باربند",
          "سراگزوز",
          "سر دندع",
          "روکش صندلی",
          "لوازم ضد سرقت",
          "لوازم تزئینی خودرو",
          "چادر خودرو",
          "تجهیزات راحتی سرنشین",
          "تجهیزات نظم دهنده",
          "عایق کاپوت، صندوق و دربها",
          "کفپوش صندوق خودرو",
          "کفپوش خودرو"
        ]},
        {"title": "لوازم یدکی خودرو",
          "items": [
          "لوازم بدنه",
          "چراغ",
          "آینه جانبی",
          "لوازم جلوبندی و تعلیق",
          "لوازم الکترونیکی",
          "لوازم مکانیکی"
        ]},
        {"title": "لوازم صوتی و تصویری",
          "items": [
          "دستگاه پخش",
          "بلندگو",
          "آمپلی فایر",
          "اف ام پلیر",
          "مسیریاب خودرو",
          "لوازم جانبی صوتی و تصویری"
        ]},
        {"title": "خودرو",
          "items": []},
        {"title": "موتورسیکلت",
        "items": []},
        {"title": "لوازم مصرفی خودرو",
          "items": [
          "روغن موتور",
          "فیلترها",
          "قطعات سرویسی",
          "روغن گیربکس",
          "روغن هیدرولیک",
          "ضدیخ و آب رادیاتور",
          "باتری",
          "لاستیک",
          "مکمل سوخت و روغن",
          "واکس و پولیش",
          "لوازم نظافتی خودرو"
        ]}
      ]
    },
    {
      "title":"ورزش و سفر",
      "categories": [
        {"title": "اسکوتر برقی",
          "items": []},
        {"title": "اسکیت و اسکوتر",
          "items": []},
        {"title": "لوازم ورزشی",
          "items": []},
          {"title":"ورزش های هوازی و بدنسازی",
            "items": [
            "تجهیزات جانبی ایروبیک و تناسب اندام",
            "دمبل",
            "طناب",
            "بارفیکس",
            "تردمیل",
            "لوازم پوششی و محافظتی ورزشی"
          ]},
          {"title": "ورزش های توپی",
            "items": [
            "توپ",
            "راکت"
          ]},
          {"title": "ورزش های آبی",
            "items": []},
          {"title": "ورزش های رزمی",
            "items": []},
       {"title": "کوهنوردی و کمپینگ",
        "items": [
          "کفش کوهنوردی",
          "عصای کوهنوردی",
          "چراغ قوه و چراغ پیشانی",
          "چاقو و ابزار چندکاره",
          "قمقمه و فلاسک",
          "چادر",
          "کیسه خواب",
          "زیرانداز سفری",
          "تجهیزات جانبی سفر و کمپینگ"
        ]},
        {"title": "چتر",
          "items": []},
        {"title": "ساک ورزشی",
          "items": []},
        {"title": "قمقمه شیکر",
          "items": []},
        {"title": "پوشاک ورزشی مردانه",
          "items": []},
        {"title": "پوشاک ورزشی زنانه",
          "items": []},
        {"title": "کفش ورزشی مردانه",
          "items": []},
        {"title": "کفش ورزشی زنانه",
          "items": []},
        {"title": "پوشاک ورزشی پسرانه",
          "items": []},
        {"title": "پوشاک ورزشی دخترانه",
          "items": []},
        {"title": "کفش ورزشی پسرانه",
          "items": []},
        {"title": "کفش ورزشی دخترانه",
          "items": []},
        {"title": "تجهیزات سفر",
          "items": [
          "ساک و چمدان",
          "کیف و کوله پشتی"
        ]},
        {"title": "دوچرخه",
          "items": [
          "لوازم جانبی دوچرخه"
        ]}
      ]
    },
    {
      "title": "محصولات بومی و محلی",
      "categories": [
        {"title": "اکسسوری و زیورآلات دست ساز",
          "items": []},
        {"title": "پوشاک بومی و محلی",
          "items": []},
        {"title": "قالی و قالیچه",
          "items": []},
        {"title": "ظروف سنتی",
          "items": [
          "آجیل خوری سنتی",
          "دیس و سینی سنتی",
          "قندان سنتی",
          "بشقاب سنتی",
          "لیوان سنتی",
          "دیگ و قابلمه سنتی"
        ]},
        {"title": "لوازم آشپزخانه سنتی",
          "items": [
          "سبد دستبافت",
          "هاون سنتی",
          "تخته سرو دست ساز"
        ]},
        {"title": "رومیزی، رانر و زیربشقابی سنتی",
          "items": []},
        {"title": "دکوراتیو سنتی",
          "items": [
          "لوستر و چراغ آویز دست ساز",
          "مجسمه دست ساز",
          "گلدان دست ساز",
          "تابلو سنتی",
          "ست هدیه سنتی",
          "ست هفت سین سنتی",
          "کاشی سنتی",
          "آینه سنتی",
          "محصولات بافتنی"
        ]},
        {"title": "خانه و کاشانه",
          "items": []},
        {"title": "نوشیدنی های ارگانیک",
          "items": [
          "چای ارگانیک ایرانی",
          "دمنوش گیاهی"
        ]},
        {"title": "خشکبار و آجیل سنتی",
          "items": [
          "آجیل سنتی",
          "خرمای محلی"
        ]},
        {"title": "غلات و حبوبات ارگانیک",
          "items": [
          "غلات ارگانیک",
          "حبوبات و سویا ارگانیک"
        ]},
        {"title": "ادویه و چاشنی ارگانیک",
          "items": [
          "ادویه های ارگانیک",
          "زعفران و زرشک ارگانیک"
        ]},
        {"title": "عطاری",
          "items": []},
        {"title": "ترشیجات و شور خانگی",
          "items": []},
        {"title": "مواد غذایی ارگانیک",
          "items": []},
        {"title": "خواروبار محلی",
          "items": [
          "برنج محلی",
          "روغن محلی"
        ]},
        {"title": "صبحانه محلی",
          "items": [
          "عسل طبیعی",
          "حلوا شکری، ارده و کنجد سنتی"
        ]},
        {"title": "کیک و شیرینی خانگی",
          "items": [
          "شیرینی خانگی",
          "کیک و کلوچه محلی"
        ]},
        {"title": "تنقلات خانگی",
          "items": [
          "لواشک، برگه و آلوچه خانگی",
          "تخمه و مغز طعم دار محلی"
        ]},
        {"title": "لبنیات سنتی",
          "items": [
          "کره گیاهی و حیوانی محلی"
        ]}
      ]
    }                      
  ];

  const [indexOfHover, setIndexOfHover] = useState(0);

  const { header, loading, error } = useSelector((state) => state.header);
  const dispatch = useDispatch();
  useEffect(() => {
    setTimeout(() => {
      dispatch(fetchHeader());
    }, 1000);
  }, []);

  const { user, loadingUser, errorUser } = useSelector((state) => state.user);
  const dispatch2 = useDispatch();
  useEffect(() => {
    setTimeout(() => {
      dispatch2(fetchUser());
    }, 1000);
  }, []);

  const [width, setWidth] = useState(window.innerWidth);

  useEffect(() => {
    const updateWindowDimensions = () => {
      const newWidth = window.innerWidth;
      setWidth(newWidth);
    };
    window.addEventListener("resize", updateWindowDimensions);
    return () => window.removeEventListener("resize", updateWindowDimensions);
  }, []);

  return (
    <>
      <header className="sticky top-0 z-20 bg-white">
        <div className="">
          <a href="" className="w-full lg:h-[60px] h-[35px] block">
            <img
              className="h-full object-cover"
              src="https://dkstatics-public.digikala.com/digikala-adservice-banners/2d75d44c81aa9afea6488551dab1a3725f2d6cee_1727184968.gif?x-oss-process=image"
              alt=""
            />
          </a>
        </div>
        <div className="h-[68px] lg:flex hidden items-center justify-between px-5">
          <div className="flex items-center gap-4">
            <div>
              <img
                className="h-[30px]"
                src="https://www.digikala.com/brand/full-horizontal.svg"
                alt=""
              />
            </div>
            <div className="bg-[#F0F0F1] w-[600px] h-[44px] rounded-lg px-3">
              <Icon className="text-gray-400" icon={ic_search} size={27} />
              <input
                type="text"
                placeholder="جستجو"
                className="bg-transparent focus:outline-none h-full text-xs text-gray-500 pr-3"
              />
            </div>
          </div>
          <div className="flex items-center h-fit gap-4">
            {/* ???????????????? */}
            {!user ? (
              <button className="h-[40px] flex items-center gap-1 px-5 border border-gray-300 rounded-lg text-xs font-semibold">
                <Icon
                  icon={login}
                  size={22}
                  className="text-gray-600 -scale-x-100"
                />
                {"خروج از حساب"}
              </button>
            ) : (
              <Link
                to={{ pathname: "/login" }}
                className="h-[40px] flex items-center gap-1 px-5 border border-gray-300 rounded-lg text-xs font-semibold"
              >
                <Icon
                  icon={login}
                  size={22}
                  className="text-gray-600 -scale-x-100"
                />
                {"ورود | ثبت‌نام"}
              </Link>
            )}
            <div className="w-[1px] bg-gray-400 h-[30px]"></div>
            <Icon
              icon={shoppingCart}
              size={25}
              className="text-gray-600 -scale-x-100"
            />
          </div>
        </div>
        <div className="px-3 flex lg:hidden flex-col gap-2 py-2">
          <div className="flex justify-between">
            <div className="flex gap-2 items-center">
              <Icon icon={x} className="text-gray-500"></Icon>
              <img
                className="w-[32px] h-[32px]"
                src="https://www.digikala.com/statics/img/png/Logo.webp"
                alt=""
              />
              <span>اپلیکیشن دیجی‌کالا</span>
            </div>
            <a
              className="h-[36px] px-3 rounded-lg flex items-center bg-black text-white text-[12px]"
              href=""
            >
              نصب
            </a>
          </div>
          <div className="w-full h-[40px] bg-[#F0F0F1] rounded-3xl flex gap-2 items-center px-2">
            <Icon className="text-gray-400" icon={ic_search} size={27} />
            <span className="text-gray-400 text-sm">جستجو در </span>
            <img
              className="h-[16px]"
              src="https://www.digikala.com/brand/typography.svg"
              alt=""
            />
          </div>
        </div>
        {header ? (
          <nav className="h-[40px] lg:flex hidden justify-between px-2">
            <div className="flex gap-2">
              <div
                id="submenu"
                className="border-b-2 border-b-transparent hover:border-b-red-500 transition-all duration-300 ease-linear origin-right"
              >
                <NavbarItems
                  icon={NavbarItemsP?.productSorting.icon}
                  text={header?.productSorting.text}
                  size={"text-md"}
                  color={header?.productSorting.color}
                />
              </div>
              <div className="text-gray-300 mt-2">|</div>
              <div className="flex">
                {NavbarItemsP?.digikalaPagesNavbar.map((elem, index) => {
                  return (
                    (index < 4 || width > 1280) && (
                      <div
                        key={index}
                        className="border-b-2 border-b-transparent hover:border-b-red-500 transition-all duration-300 ease-linear origin-right"
                      >
                        <NavbarItems
                          icon={elem.icon}
                          text={elem.text}
                          color={"text-gray-500"}
                          size={"text-xs"}
                        />
                      </div>
                    )
                  );
                })}
              </div>
              <div className="text-gray-300 mt-2">|</div>
              <div className="flex">
                {header?.digikalaQuestionsNavbar.map((elem, index) => {
                  return (
                    <div
                      key={index}
                      className="border-b-2 border-b-transparent hover:border-b-red-500 transition-all duration-1000"
                    >
                      <NavbarItems
                        icon={elem.icon}
                        text={elem.text}
                        color={"text-gray-500"}
                        size={"text-xs"}
                      />
                    </div>
                  );
                })}
              </div>
            </div>
            <div>
              <NavbarItems
                icon={NavbarItemsP?.locationNavbar.icon}
                text={header?.locationNavbar.text}
                size={"text-xs"}
                color={"text-gray-800"}
              />
            </div>
          </nav>
        ) : null}
        <hr />
      </header>

      <div className="flex gap-1 border w-[1100px] h-[70vh] m-2">
        <div dir="ltr" className="overflow-y-scroll w-[200px] h-full">
          {submenu.map((elem, i) => {
            return (
              <div dir="rtl"
                onMouseEnter={() => setIndexOfHover(i)}
                className="py-3 bg-blue-400 border text-sm"
              >
                {elem.title}
              </div>
            );
          })}
        </div>
        <div dir="ltr" className="w-full overflow-y-scroll text-xs">
          {submenu.map((section, i) => {
            return (
              <div dir="rtl"
                className={`${false ? "hidden" : ""} ${
                  i == indexOfHover ? "flex" : "hidden"
                } w-full py-5 my-1 bg-pink-500 flex-col`}
              >
                <h3 className="bg-yellow-200 text-cyan-600">
                  همه محصولات {section.title}
                  <Icon icon={arrow_left} />
                </h3>
                <div className="flex flex-col flex-wrap max-h-[1200px]">
                  {section.categories.map((column) => {
                    return (
                      <div className="bg-yellow-50 m-1">
                        <span className="text-sm block py-3 bg-lime-200 hover:text-rose-700">
                          <span className="px-1 text-red-600 font-extrabold">
                            |
                          </span>
                          {column.title}
                        </span>
                        <div className="flex flex-col">
                          {column?.items.map((items) => {
                            return (
                              <span className="px-1 py-3 border border-black text-gray-500 hover:text-rose-700">
                                {" "}
                                {items}{" "}
                              </span>
                            );
                          })}
                        </div>
                      </div>
                    );
                  })}
                </div>
              </div>
            );
          })}
        </div>
      </div>
    </>
  );
};

export default Header;
